app/Controllers/AchatController.php

    public function addToCart(int $produitId, int $quantity)
    {
        if ($quantity < 1) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Quantité invalide.'
            ]);
        }

        $pm = new ProduitModel();
        $produit = $pm->find($produitId);
---
SELECT *
FROM `produit`
WHERE `produit`.`id` = 3