app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `identifiant` = 'uchi67'
 LIMIT 1
---
    public function login() {
        // Validation basique des champs reçus
        $rules = [
            'identifiant' => 'required',
            'mdp'         => 'required',
        ];

        if (!$this->validate($rules)) {
            return redirect()
                ->to('auth/index')
                ->withInput()
                ->with('errors', $this->validator->getErrors());
        }

        $identifiant = $this->request->getPost('identifiant');
        $motDePasse  = $this->request->getPost('mdp');

        // 1. On cherche l'utilisateur par son identifiant
        $userModel = new UserModel();
        $user = $userModel->where('identifiant', $identifiant)->first();