app/Controllers/HomeController.php

    public function index(): string
    {
        $cm = new CaisseModel();
        $caisses = $cm->findAll();
---
SELECT *
FROM `caisse`