app/Controllers/SaisieController.php

SELECT *
FROM `produit`
---
    public function index(): string
    {
        $pm = new ProduitModel();
        $produits = $pm->findAll();

SELECT *
FROM `produit`
WHERE `produit`.`id` = 2
INSERT INTO `achat` (`idProduit`, `idCaisse`, `dateAchat`, `qtt`) VALUES (2, 1, '2026-06-17 08:47:59', 67)
SELECT *
FROM `produit`
---
    public function confirmer()
    {
        $cart = session()->get('cart') ?? [];
        $pm = new ProduitModel();

        foreach ($cart as $produitId => $quantite) {
            $produit = $pm->find($produitId);

            if (!$produit) {
                continue;
            }

            $achat = new AchatModel();

                $achat->save([
                    'idProduit' => $produitId,
                    'idCaisse'  => session()->get('caisse_id'),
                    'dateAchat' => date('Y-m-d H:i:s'),
                    'qtt' => $quantite
                ]);

        }

        // La vente est encaissée : on vide le panier pour le client suivant
        session()->remove('cart');

        return view('saisie', [
            'produits' => $pm->findAll(),
        ]);