app/Models/CaisseModel.php

SELECT *
FROM `caisse`
WHERE `nom` = 'Caisse 1'
 LIMIT 1
---
    public function getCaisseByName($name){
        return $this->where('nom', $name)->first();